Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/pricing/price_display_of_goods_and_services.html.txt.tmx
Source language: en
Languages: ga

source: Display of prices for goods and services
ga: Taispeáint praghsanna d'earraí agus seirbhísí

source: In Ireland while there are no controls on prices, there is legislation the way prices of products and services are displayed to consumers
ga: Cé nach bhfuil aon rialuithe ann ar phraghsanna in Éirinn, tá ann do reachtaíocht a bhaineann le praghsanna táirgí agus seirbhísí atá ar fáil do thomhaltóirí

source: These laws consist of the EC (Requirements to Indicate Product Prices) Regulations 2002 and Orders made under the Prices Act 1958 to 1972 and the Consumer Protection Act 2007 (pdf). The legislation ensures that consumers have enough information to make price comparisons between different products and services
ga: Cinntíonn Rialúcháin an CE (Ceanglais maidir le Praghsanna Táirgí a chur in iúl) 2002 agus Orduithe a rinneadh faoi Acht na bPraghsanna 1958 go 1972 agus An tAcht um Chosaint Tomhaltóirí 2007 go mbíonn dóthain eolais ag tomhaltóirí chun comparáidí praghais a dhéanamh idir taírgí agus seirbhísí

source: Under the European Union (Provision of Services) Regulations 2010 certain service providers should provide the price of a service or a detailed estimate of a price for a service at the request of the recipient
ga: Faoi na Rialacháin an Aontais Eorpaigh (Soláthar Seirbhísí), 2010, ba cheart do sholáthraithe seirbhíse airithe an praghas a bhíonn ar sheirbhís nó meastachán mionsonraithe ar phraghas a sholáthar do sheirbhís ar iarraidh an fhaighteora

source: The European Union (Consumer Information, Cancellation and Other Rights) Regulation 2013 provides protection to consumers from excessive and stealth charges separate from and additional to the price paid for goods or services under a consumer contract
ga: Soláthraíonn Rialachán an Aontais Eorpaigh (Faisnéis do Thomhaltóirí, Cealú agus Cearta Eile), 2013 cosaint do thomhaltóirí ó mhuirir iomarcacha agus faoi choim a ghearrtar ar leithligh ó agus anuas air an bpraghas a íoctar as earraí nó seirbhísí faoi chonradh tomhaltóra

source: The purpose of the EC (Requirements to Indicate Product Prices) Regulations 2002 is to enable consumer to see the price of the product before buying and to make price comparisons
ga: Is é cuspóir na Rialúchán um Phraghsáil Táirgí 2002 ná le cur ar chumas tomhaltóirí praghas an táirge a fheiceáil sula gceannaítear é agus chun comparáidí praghais a dhéanamh

source: The price of products on sale in shops and supermarkets may be attached to the items themselves
ga: Is féidir praghas na dtáirgí a bhíonn ar díol i siopaí agus margaí siopadóireachta a ghreamú leis na míreanna iad féin

source: Alternatively they may be displayed on a label on the edge of the shelf
ga: Is féidir iad a thaispeáint mar mhalairt ar lipéad ar imeall na seilfe

source: Generally, shelf labels are used to display prices in supermarkets since barcodes have becomes more popular
ga: Úsáidtear lipéid seilfe go ginearálta chun praghsanna a thaispeáint sna lárionaid siopadóireachta ó d’éirigh barrachóid coitianta

source: Under the EC (Requirements to Indicate Product Prices) Regulations 2002, retailers must show the correct selling price in euro including taxes
ga: Faoi na Rialúcháin um Phraghsanna Táirgí 2002, ní mór do mhiondíoltóirí an praghas díolta ceart a thaispeáint in euro, cánacha san áireamh

source: Unit prices for products sold by weight volume or measure must also be clearly displayed
ga: Ní foláir Praghais aonaid a dhíoltar trí thoirt, meáchan nó tomhas a thaispeáint go soiléir freisin

source: More detailed information on pricing of goods and services is available here
ga: Tá faisnéis níos mionsonraithe ar fáil faoi phraghsáil earraí agus seirbhísí ar fáil anseo

source: The Regulations provide for certain exemptions from unit pricing such as items which are equal or less than 50 ml or 50 grams. The Regulations also extend to online shopping
ga: Soláthraíonn na rialúcháin do dhíolúintí áirithe ó phraghsáil aonaid ar nós míreanna ar comhionann nó níos lú ná 50 ml nó 50 gram iad

source: Services are not covered by the Product Pricing Regulations
ga: Síníonn na Rialúcháin go siopadóireacht ar líne freisin

source: The Prices and Charges (Tax-Inclusive Statements) Order, 1973 requires that all prices marked on goods or prices displayed or quoted at the retail level and all charges for services displayed or quoted should be tax-inclusive (e.g
ga: Tá sé riachtanach faoin Ordú um Praghsanna agus Táillí (Ráitis Cháin-Áirithe), 1973 go mba cheart do cháin a bheith cuimsithe le gach praghas a mharcáltar ar earraí agus praghsanna a thaispeántar nó a luaitear ag an leibhéal miondíola (m.sh

source: VAT) except where it is intended solely for a business customer
ga: CBL) mura gceaptar gur don chustaiméir gnó iad

source: The Retail Price (Beverages in Licensed Premises) Display Order, 1999 is designed to inform customers about the prices charged in licensed premises
ga: Ceaptar an tOrdú Taispeána chun Praghasanna Miondíola (Deochanna in Áitribh Cheadúnaithe) a Thaispeáint, 1999 le custaiméirí a chur ar an eolas faoi na praghsanna a ghearrtar in áitreabh ceadúnaithe

source: Licensed premises in Ireland includes bars, night-clubs, or other venues that require a vintners license to operate
ga: Áirítear le háitreabh ceadúnaithe in Éirinn beáir, clubanna oíche, nó ionaid eile óna dteastaíonn ceadúnas fíoncheannaithe chun oibriú

source: The order states that licensed premises display 2 lists of drinks prices
ga: Maíonn an t-ordú go dtaispeánfadh áitreabh ceadúnaithe 2 liosta de phraghsanna dí

source: A comprehensive list of all items sold and a summary (i.e., abbreviated) list of the 16 most popular drinks for sale
ga: Liosta cuimsitheach de gach mír a dhíoltar agus liosta achomair de na 16 deoch is coitianta ar díol

source: If there are different prices in different areas of the licensed premises (for example prices for drinks are different in the Lounge and in the Bar) these notices need to be displayed prominently in all areas where the products are sold
ga: Má tá praghsanna éagsúla ann i limistéir éagsúla d’áitreabh ceadúnaithe (mar shampla praghsanna deochanna a bheith éagsúil sa Tolglann agus sa Bheár) ní foláir na fógraí seo a thaispeáint go feiceálach i ngach ionad ina ndíoltar na táirgí

source: If the prices change after a certain time (for example after 11p.m.) this also needs to be displayed on the notice
ga: Ba chóir go gcuimseodh na liostaí praghais deochanna a dhíoltar lena dtomhailt ar an áitreabh

source: Price lists should cover drinks sold for consumption on the premises
ga: Ní chuimsítear ionaid eischeadúnais leis

source: Off-licences are not covered by this Order but they are covered by the Requirements to Indicate Product Prices Regulations 2002
ga: an Ordú seo ach is amhlaidh go gcuimsíonn na Rialúcháin um Cheanglais Maidir le Praghsanna Táirgí a chur in iúl 2002

source: A 16 item list of prices needs to be displayed prominently either inside or directly outside the entrance of the premises
ga: Ní foláir liosta de 16 mír a thaispeáint go suntasach laistigh nó díreach lasmuigh de shlí isteach an áitribh

source: The following is a list of 16 items that need to be displayed by publicans to comply with the order:
ga: Is liosta é an méid seo a leanas de 16 mír nach mór do thábhairneoirí a thaispeáint cun cloí leis an ordú seo:

source: • Pint (568 ml) of draught stout
ga: • Pionta (568 ml) leanna dhuibh bhairille

source: • Pint (568ml) of draught ale
ga: • Pionta (568ml) leanna bhairille

source: • Pint (568 ml) of draught lager
ga: • Pionta (568 ml) lágair bhairille

source: • Pint (568ml) of draught cider
ga: • Pionta (568ml) cheirtlis bhairille

source: • Bottle (330ml) of stout
ga: • Buidéal (330ml) leanna dhuibh

source: • Measure (35.5ml) of whiskey
ga: • Tomhas (35.5ml) uisce beatha

source: • Bottle (200ml) of carbonated drink
ga: • Buidéal (200ml) dí bheo

source: • Bottle (200ml) of carbonated cola drink
ga: • Buidéal (200ml) dí chóla bheo

source: Both the 16 item and the comprehensive list need to be clear and visible to customers
ga: Caitheann an liosta de 16 mír agus an liosta cuimsitheach a bheith soiléir infheicthe araon do chustaiméirí

source: That means the price lists must be displayed in a prominent position where anyone could reasonably see them
ga: Ciallaíonn sé sin go gcaithfear na liostaí praghais a thaispeáint i suíomh suaithinseach mar ar féidir le duine ar bith iad a fheiceáil

source: The Competition and Consumer Protection Commission surveys licensed premises to ensure their compliance with the law
ga: Déanann an Ghníomhaireacht Náisiúnta Tomhaltóirí suirbhé ar áitribh cheadúnaithe chun a gcloí leis an dlí a chinntiú

source: It can prosecute publicans and licensees who are found to be in breach of the Order
ga: Is féidir leis tábhairneoirí agus ceadúnaithe a ionchúiseamh a mbreithnítear a bheith ag briseadh an Ordaithe

source: Food in restaurants, cafés and hotels
ga: Bia i mbialanna, caiféanna agus óstlanna

source: If you visit a restaurant you can reasonably expect to be informed about their prices for food
ga: Má thugann tú cuairt ar bhialann is féidir leat a bheith ag dúil go réasúnta go gcuirfear ar an eolas thú faoina bpraghsanna bia

source: The Retail Prices (Food in Catering Establishments) Display Order, 1984 requires the owners to display a comprehensive price list of food items
ga: Cuireann an tOrdú chun Praghsanna Miondíola (Bia in mBunaíochtaí Lónadóireachta) a Thaispeáint, 1984 de cheangal ar úinéirí liosta cuimsitheach de phraghsanna bia a thaispeáint

source: This law applies to all hotels, pubs, restaurants, cafés, etc
ga: Feidhmíonn an dlí seo do gach óstlann, teach tábhairne, bialann, caifé, srl

source: that offer food for sale and consumption on the premises
ga: a thairgíonn bia le díol agus le tomhailt ar an áitreabh

source: This notice should be visible immediately outside or inside where the food is being served
ga: Ba cheart an fógra seo a bheith infheicthe go láithreach lasmuigh nó laistigh d’ionad ina mbítear ag dáileadh bia

source: In the case of a hotel or a licensed premises where food is served in some areas, the notice can be displayed either at the entrance to the premises or at the entrance to the catering area
ga: I gcás óstlainne nó áitribh cheadúnaithe ina mbítear ag dáileadh bia i roinnt ionad, is féidir an fógra a thaispeáint ag slí isteach an áitribh nó ag slí isteach an limistéir lónadóireachta

source: Any extra charges that apply (such as service charges etc) must be stated clearly on the notice too
ga: Ní foláir aon mhuirir bhreise a bhíonn i bhfeidhm (ar nós muirir seirbhíse srl) a mhaíomh go soiléir ar an bhfógra fosta

source: The Charges (Hairdressing) Display Order, 1976 requires hairdressers to display a notice setting out the charges for every service rendered by them as a hairdresser
ga: Ní mór do ghruagairí faoin Ordú Chun Táillí (Gruagaireacht) a Thaispeáint, 1976 fógra a thaispeáint ina leagtar amach muirir do gach seirbhís a dhéanann siad mar ghruagaire

source: (In this context, the term ‘hairdressers’ also includes barbershops)
ga: (Áirítear bearblanna leis an téarma ‘gruagairí’ sa chomhthéacs seo freisin)

source: If possible the notice must be visible from the street or immediately inside the entrance to the hairdressers
ga: Más féidir é, ní mór don fhógra a bheith le feiceáil ón tsráid amuigh nó go díreach laistigh de shlí isteach na ngruagairí

source: The notice must also be clearly visible and easy to read
ga: Ní foláir don fhógra a bheith soléite agus suas chun dáta do thomhaltóirí

source: The Retail Prices (Diesel and Petrol) Display Order, 1997 requires that service stations display the prices for petrol and diesel
ga: Ní foláir do stáisiúin seirbhíse faoin Ordú chun Praghsanna Miondíola (Díosal agus Peitreal) a Thaispeáint, 1997 na praghsanna peitril agus díosail a thaispeáint

source: The notice must be clearly visible from the side of the road and be in writing at least 20cm in height
ga: Ní foláir don fhógra a bheith sofheicthe ó cholbha an bhóthair agus a bheith i scríobh nach lú ná 20cm in airde é

source: The Order specifies that the prices must be displayed in litres
ga: Sonraíonn an tOrdú nach mór na praghsanna a thaispeáint i líotair

source: In addition, the actual price charged at the petrol pump must match the price displayed
ga: Ina theannta sin, ní foláir don phraghas iarbhír a ghearrtar ag an gcaidéal peitril meaitseáil leis an bpraghas

source: Concert and theatre tickets
ga: Ticéid cheolchoirme agus amharclainne

source: The Consumer Information (Advertisements for Concert or Theatre Performances) Order, 1997 sets down that every written advertisement for a public concert or theatre performance must indicate the admission price
ga: Leagann an tOrdú um Fhaisnéis do Thomhaltóirí (Fógráin do Thaibhithe Ceolchoirme nó Amharclainne), 1997 síos nach mór gach fógra scríofa do cheolchoirm nó do léiriú amharclainne poiblí an praghas iontrála a thaispeáint

source: Any additional charge and the circumstances in which such additional charges are payable must be stated separately, in either monetary or percentage terms (for example, if there is an extra charge for paying by credit card this must be stated in the written advertisement)
ga: Ní foláir aon mhuirear breise agus na cúinsí ina mbíonn na muirir bhreise sin iníoctha a shloinneadh ar leithligh, i dtéarmaí airgeadaíochta nó céatadáin (mar shampla, má bhíonn muirear breise ann don íoc le cárta creidmheasa, ní mór é seo a bheith maíte san fhógra scríofa)

source: In all other forms of advertising (e.g
ga: I ngach aon fhoirm fógraíochta eile (m.sh

source: radio or TV advertising) the admission price must be stated together with a reference to the fact that an additional charge may be payable in certain circumstances
ga: raidió agus fógraíocht teilifíse) ní foláir don phraghas iontrála a shloinneadh in éineacht le tagairt don fhíric go bhféadfadh muirear breise a bheith iníoctha i gcúinsí áirithe

source: The Consumer Information (Advertisements for Airfares) Order, 2000 specifies rules for the advertisements of airfares
ga: Sainíonn an tOrdú um Fhaisnéis do Thomhaltóirí (Fógráin do Tháillí Aeir), 2000 rialacha d’fhógraí tháillí aeir

source: In every advertisement for airfares (including radio, television and print) the total price must be clearly stated
ga: Ní foláir an praghas iomlán a mhaíomh go soiléir i ngach fógra do tháille aeir (lena n-áirítear raidió, teilifís agus prionta)

source: Specifically this means the price payable for the airfare must include all charges (i.e., taxes, etc.)
ga: Ciallaíonn sé seo go sonrach nach mór don phraghas iníoctha don táille aeir gach muirear a áireamh (.i

source: If restrictions apply, then every restriction should be clearly specified in the advertisement
ga: cánacha, srl.). Má tá srianta i bhfeidhm, ba chóir gach srianadh a shonrú go soiléir san fhógra

source: (For example, the airfare price may only be applicable to flights between certain dates, times, etc)
ga: (Mar shampla, féadann praghas an táille aeir a bheith infheidhmithe amháin d’eitiltí idir dáta agus amanta áirithe, srl)

source: Under a Code of Practice (pdf) issued by the Dental Council, dentists must display private fees in a place where patients can view them before consultation
ga: Faoi Chód Cleachtais (pdf) arna eisiúint ag an gComhairle Fiaclóireachta, tá sé éigeantach go dtaispeánann fiaclóirí táillí príobháideacha in áit inar féidir le hothair iad a fheiceáil roimh an gcomhairliúchán

source: For certain specified procedures a single fee should apply
ga: I gcás roinnt nósanna imeachta‚ ba cheart go ngearrfaí táille shingil

source: The fee for certain other procedures should be shown as a range, with both a minimum and a maximum fee clearly stated
ga: Ba cheart an táille do na nósanna imeachta eile a thaispeáint mar réimse, agus an táille íosta agus uasta a lua go soiléir

source: For all other treatments, dentists should provide an estimate of the cost of that treatment and obtain the patient's agreement and consent before treatment starts
ga: I gcás gach cóireáil eile, ba cheart d’fhiaclóirí meastachán a thabhairt ar chostas na cóireála sin agus comhaontú an othair a fháil ar dtús sula dtosaítear leis an gcóireáil

source: You can contact the Competition and Consumer Protection Commission if you find that a retailer or service provider is not displaying prices as per the law
ga: Féadfaidh tú dul i dteagmháil leis an Ghníomhaireacht Náisiúnta Tomhaltóirí má fheictear duit nach mbíonn miondíoltóir ná soláthraí seirbhísí ag taispeáint praghsanna de réir an dlí
